stressTest/loadtest.yml
config:
  target: 
  tls:
    rejectUnauthorized: false
  payload:
    -
      path: "../token.csv"
      fields:
        - "token"
        - "userId"
        - "nickname"
    -
      path: "../data.csv"
      fields:
        - "dataId"
  http:
    timeout: 5
  phases:
    # - duration: 10
    #   arrivalRate: 10
    - duration: 1000
      arrivalRate: 50
    # - duration: 10
    #   arrivalRate: 10

scenarios:
  - name: "get main"
    weight: 10
    flow:
      - get:
          url: "/api/policies"
          headers:
            User-Agent: "Artillery"
            Authorization: "Bearer {{ token }}"
  - name: "get detail"
    weight: 5
    flow:
      - get:
          url: "/api/policies/{{ dataId }}"
          headers:
            User-Agent: "Artillery"
            Authorization: "Bearer {{ token }}"
  - name: "put mark"
    weight: 2
    flow:
      - put:
          url: "/api/marks"
          headers:
            User-Agent: "Artillery"
            Authorization: "Bearer {{ token }}"
          json:
            dataId: "{{ dataId }}"
  - name: "get mark"
    weight: 10
    flow:
      - get:
          url: "/api/marks/{{ userId }}"
          headers:
            User-Agent: "Artillery"
            Authorization: "Bearer {{ token }}"
  - name: "search"
    weight: 2
    flow:
      - post:
          url: "/api/search"
          headers:
            User-Agent: "Artillery"
            Authorization: "Bearer {{ token }}"
          json: 
            searchKey: "청년"
            type: "통합검색"
  - name: "get user"
    weight: 10
    flow:
      - get:
          url: "/api/users/{{ userId }}"
          headers:
            User-Agent: "Artillery"
            Authorization: "Bearer {{ token }}"
  - name: "patch user"
    weight: 1
    flow:
      - patch:
          url: "/api/users/{{ userId }}"
          headers:
            User-Agent: "Artillery"
            Authorization: "Bearer {{ token }}"
          json:
            age: 19991012
            gender: ["남성"]
            region: "------- 시·군을 선택해 주세요"
            disability: ["없음"]
            obstacle: []
            job: []
            marriage: []
            target: []
            salary: 0
            scholarship: []
            family: 0
            workType: []
  - name: "get news"
    weight: 10
    flow:
      - get:
          url: "/api/news"
          headers:
            User-Agent: "Artillery"
            Authorization: "Bearer {{ token }}"